// Напишите программу вычисления значения функции возведения числа в квадрат.

Console.WriteLine("Hello, World!");
